var app = angular.module('sportApp', ['appRoutes']);

app.service('newsService', function() {
    this.getNews = function() {
        return newsList;
    };

    this.addNews = function(title, category, name, imgUrl, content, date) {
        var id = newsList.length + 1;
        newsList.push({
            id: id,
            title: title,
            category: category,
            name: name,
            imgUrl: imgUrl,
            content: content,
            date: date
        });
    };

    this.deleteNews = function(id) {
        for (var i = newsList.length - 1; i >= 0; i--) {
            if (news[i].id === id) {
                newsList.splice(i, 1);
                break;
            }
        }
    };

    var newsList = [{
            id: 1,
            title: 'БФС обяви кога ще се играят 1/4-финалите за Купата, ЦСКА-София - Лудогорец е в четвъртък',
            category: 'Футбол',
            name: 'football',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693108.jpg?20171107191513',
            content: 'БФС обяви датите и часовете на 1/4-финалите от турнира за купата на България. Двубоят между ЦСКА-София и Лудогорец ще се играе на 14 декември (четвъртък) от 17.30 часа. Така червените ще имат ден повече за почивка, тъй като последният им есенен мач от първенството срещу Берое ще се проведе в неделя, а двубоят на разградчани с Пирин ще е в понеделник.',
            date: Date()
        },
        {
            id: 2,
            title: 'Драма в Пловдив! Марица допусна пълен обрат от 2:0 гейма',
            category: 'Волейбол',
            name: 'volleyball',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693120.jpg?20171107211019',
            content: 'Марица Пловдив загуби драматично с 2:3 (25:21, 25:18, 22:25, 20:25, 14:16) у дома срещу Енисей Красноярск в първа среща от третия кръг в Шампионската лига по волейбол при жените. В пловдивската зала "Колодрума" българският шампион поведе в резултата с 2:0 след силна игра в самото начало, но след това допусна обрат срещу по-опитния си съперник след изиграването на тайбрек.Марица взе аванс в двубоя след 25:21 и стабилна игра в края на първата част. Представянето на българките и във втория гейм беше изключително силно и преднината в края му беше още по-категорична - 25:18. Обратът започна в третата част, когато рускините имаха предимство и се върнаха в мача след 22:25. Четвъртият гейм отново премина под диктовката на Енисей и крайното 20:25 доведе срещата до тайбрек.',
            date: Date()
        },
        {
            id: 3,
            title: 'Латвийска доминация при обрат на Никс',
            category: 'НБА',
            name: 'nba',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00692831.jpg?20171106105244',
            content: 'Кристапс Порзингис отбеляза рекордните за кариерата си 40 точки, а тимът на Ню Йорк регистрира петата си победа за сезона, след като се наложи със 108:101 над Индиана у дома в "Медисън Скуеър Гардън". Нюйоркчани губеха с 19 точки в края на третата четвърт, но след 36:17 в последната част гостите направиха пълен обрат. Тим Хардауей-младши прибави 16 точки за победителите, новобранецът Франк Нтиликина завърши с 10, а турският център Енес Кантер завърши с 9 точки и 18 борби. Порзингис пък допълни фантастичната си игра с 8 борби, 1 асистенция и 6 чадъра.За Индиана 18 точки отбеляза Тадиъс Йънг, Виктор Оладипо прибави 17, а с 16 остана Домантас Сабонис.',
            date: Date()
        },
        {
            id: 4,
            title: 'Какво ще се случи с двигателите във Формула 1 през 2021 година?',
            category: 'Формула1',
            name: 'formula',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693104.jpg?20171107191403',
            content: 'Във Формула 1 бяха направени първите стъпки за бъдещето на спорта по време на първата среща на представители от ФИА и представители на собствениците на отбори. Надеждите всичко да мине гладко, без разделяне на лагери и политически игри, се разбиха на пух и прах само 48 часа след срещата.Първи се чу гласът на заводските отбори на шампионите от Мерцедес и французите от Рено, които освен за своите болиди създават двигатели и за други отбори. Според тях промените ще доведат до ненужна война за мощност, която няма да е добра за развитието на спорта като цяло.Миналата седмица Ферари стигнаха по-далеч. Отборът, с който светът асоциира Формула 1, заплаши официално, че може да напусне спорта, ако италианците останат недоволни от посоката, по която шефовете на ФИА и Ф1 решат да поеме спортът от 2021 година напред.Основното притеснение и на тримата производители е, че те ще продължат да развиват актуалните двигатели и системи за задвижване в следващите три години, борейки се за световната титла. От друга страна, нов производител може да се концентрира само в работата си по напълно новите двигатели и да влезе във Формула 1 при променените правила с предимство. Потенциални такива са Aston Martin, Porsche, Cosworth и Ilmor. Възможно е също да се върнат оттеглили се преди години автомобилни производители като BMW и Toyota.',
            date: Date()
        },
        {
            id: 5,
            title: 'Григор Димитров влезе в клуба на тенис елита',
            category: 'Тенис',
            name: 'tennis',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00692993.jpg?20171107110432',
            content: 'Григор Димитров се наслаждава на най-успешния сезон в кариерата си, след като спечели титлите в Бризбън и София, игра полуфинал на Australian Open, покори за първи път турнир от сериите “Мастърс” - в Синсинати - и стигна рекордното шесто място в световната ранглиста по тенис. Освен всичко това, хасковлията се класира за първи път за Финалите на АТР и по този начин стана част от наистина елитна компания.По отношение на брой участия в последния за годината турнир Роджър Федерер е лидер с цели 15. Швейцарецът ще се бори за седма титла в Лондон, след като увеличи преднината си по показател присъствие пред Андре Агаси (13), Иван Лендъл (12), Борис Бекер, Джими Конърс, Пийт Сампрас (по 11), Новак Джокович (10), Стефан Едберг и Джон Макенроу (9).',
            date: Date()
        },
        {
            id: 6,
            title: 'Spartacus (SFC6) предизвиква най-добрите наши бойци в зала “Арена Армеец”',
            category: 'ММА',
            name: 'mma',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693006.jpg?20171107113207',
            content: 'Най-зрелищното събитие в ММА средите у нас – Spartacus (SFC6), ще разтърси столичната зала „Арена Армеец“ догодина. Престижният турнир се завръща ударно на 13 януари 2018 г. с шестото си издание, на което ще бъдат показани над 15 двубоя в стил ММА и К1.Промоутърите от Combat Promotion вече пуснаха в продажба билетите за голямото спортно събитие, което традиционно е съпътствано и от уникална шоу програма. Цените на пропуските са от 45, 30 и 10 лв. и могат да бъдат намерени в мрежите на Eventim, Easypay и Ticketportal.',
            date: Date()
        },
        {
            id: 7,
            title: 'Олимпийски шампион готов да стигне до Европейския съд, за да докаже, че е чист',
            category: 'Зимни спортове',
            name: 'winter-sports',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693016.jpg?20171107115729',
            content: ' Дисквалифицираният олимпийски шампион по ски-бягане Александър Легков заяви, че е невинен и ще се бори срещу обвиненията за употеба на допинг срещу него с всички законови средства, както е готов да стигне и до Европейския съд, ако се наложи."Медалът ми е чист. Готов съм да се боря, за да го докажа. Единственото нещо, което искам, е справедливо отношение, независими арбитри и честен процес, основаващ се на закона, без значение дали във Висшия спортен арбитражен съд, в Швейцарския федерален съд, или в Европейския съд", заяви руснакът. МОК дисквалифицира Легков от Олимпиадата в Сочи 2014, където той спечели злато на 50 километра и сребро с щафета на "Сборная", във връзка с обвиненията за употреба на забранени вещества и манипулиране на допинг-проби в руския отбор.Санкцията беше наложена след доклад на независима антидопингова комисия на УАДА, въпреки че в него не бяха посочени конкретни имена',
            date: Date()
        },
        {
            id: 8,
            title: 'Защо Гризман бяга от отборните снимки на Атлетико?',
            category: 'Футбол',
            name: 'football',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693109.jpg?20171107192528',
            content: 'Неведнъж Антоан Гризман е уловен от фотографите как първи се изстрелва след отборната снимка на Атлетико Мадрид преди началото на мача. Някои фотографи дори не успяват да направят нормална снимка, тъй като френският голмайстор бързо се отмества настрани. Вестник Marca се опитва да разтълкува откъде идва този навик на Гризи.Според тях Антоан няма търпение двубоят да започне, да се срещне с топката и да отбележи. Стрелецът играе неубедително в последните седмици, а наставникът Диего Симеоне призова феновете да го подкрепят. “Не е в най-добрата си форма, но ние трябва да го подкрепяме, защото сезонът е дълъг и ще имаме нужда от неговата помощ”, сподели аржентинецът.',
            date: Date()
        },
        {
            id: 9,
            title: 'Ървинг се развихри с 35 точки за успех на Бостън, Бруклин надделя над Финикс',
            category: 'НБА',
            name: 'nba',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00693005.jpg?20171107112644',
            content: 'Кайри Ървинг отбеляза 35 точки, а Джейсън Татъм добави 21 за победата на Бостън със 110:107 срещу Атланта.Това беше девети пореден успех за Селтикс, които поведоха със 104:103 след тройка на Ървинг от дясното крило само 1:37 минути преди края и повече не изпуснаха аванса си. ',
            date: Date()
        },
        {
            id: 10,
            title: 'Мъри се завръща на корта за благотворителен мач с Федерер',
            category: 'Тенис',
            name: 'tennis',
            imgUrl: 'https://img4.sportal.bg/uploads/news/2017_45/images/00692982.jpg?20171107095403',
            content: 'Анди Мъри се завръща днес на корта за благотворителен мач с Роджър Федерер в Глазгоу. Шоуто ще се предава пряко от 21:30 ч. по Евроспорт 1 с коментара на Йордан Божинов. Олимпийският шампион не е играл откакто загуби полуфинала на "Уимбълдън" срещу Сам Куери на 12 юли. Мъри отказа всички турнири оттогава заради проблем с бедрото, но последните новини казват, че е готов за игра. Шотландецът промени тренировъчния си режим в опит да избегне оперативната намеса.Мачът с Федерер ще покаже доколко е възстановен от травмата и дали ще е готов за турнира в Бризбън в първата седмица на новата година, когато планира завръщането си в тура.',
            date: Date()
        }
    ];

});



app.service('userService', function() {
    this.getUsers = function() {
        return users;
    };

    this.regUser = function(username, password, email) {
        var id = users.length + 1;
        users.push({
            id: id,
            username: username,
            password: password,
            email: email
        });
    };

    // //added
    // var loggedUserKey = "loggedUsers";

    // function initUser() {
    //     for (var i = 0; i < staticUsers.length; i++) {
    //         localStorage.setItem(staticUsers[i].username, JSON.stringify(staticUsers[i]));
    //     }
    // }

    // window.onload = function() {
    //     initUser();
    // };


    // function doLogin(username, password) {
    // var userJSON = localStorage.getItem(username);
    // if (userJSON) {
    //     var user = JSON.parse(userJSON);
    //     if (user.password === password) {
    //         logInUser(user);
    //         alert("Влязохте успешно");
    //             return true;
    //         } else {
    //             alert("Грешна парола");
    //             return false;
    //         }
    //     } else {
    //         alert("Потребителят не  е открит")
    //         return false;
    //     }
    // }

    // function login() {
    //     var username = document.getElementById("username");
    //     var pass = document.getElementById("password");
    //     return doLogin(username.value, pass.value);
    // }

    // function getLogedUser() {
    //     return JSON.parse(localStorage.getItem(loggedUserKey));
    // }

    // function logInUser(user) {
    //     localStorage.setItem(loggedUserKey, JSON.stringify(user));
    // }

    // //old


    this.loginUser = function(username, password) {
        return this.users.some(user => user.username === username &&
            user.password === password);
    }

    var users = [{
        username: 'admin',
        password: 'admin',
        email: 'admin@admin.com',
        visible: true
    }];

});